---
kind: type
id: T:Autodesk.Revit.DB.IFCVersion
source: html/03f1bce3-dd39-9deb-c732-db82474cb40b.htm
---
# Autodesk.Revit.DB.IFCVersion

An enumerated type listing available IFC file versions into which a file may be exported.

## Syntax (C#)
```csharp
public enum IFCVersion
```